Тестовая_база_ERP_14/src/AccumulationRegisters/ОбеспечениеПроизводственныхПроцессов/ОбеспечениеПроизводственныхПроцессов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОбеспечениеПроизводственныхПроцессов</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Требуется</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Запланировано</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПереданоКПроизводству</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Производится</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Произведено</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ГотовКРазборке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗапланированаРазборка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТребуетсяРазборка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Распоряжение</name>
    <type>
      <types>DocumentRef.ЗаказНаПроизводство2_2</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Спецификация</name>
    <type>
      <types>CatalogRef.РесурсныеСпецификации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Назначение</name>
    <type>
      <types>CatalogRef.Назначения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Этап</name>
    <type>
      <types>DocumentRef.ЭтапПроизводства2_2</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СписатьНаРасходы</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяРасходов</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
      <types>ChartOfCharacteristicTypesRef.СтатьиАктивовПассивов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АналитикаРасходов</name>
    <type>
      <types>Characteristic.СтатьиРасходов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АналитикаАктивовПассивов</name>
    <type>
      <types>Characteristic.СтатьиАктивовПассивов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Тестовая_база_ERP_14/src/Enums/СтатусыЭтаповПроизводства2_2/СтатусыЭтаповПроизводства2_2.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыЭтаповПроизводства2_2</name>
  <enumValues>
    <name>Формируется</name>
  </enumValues>
  <enumValues>
    <name>Сформирован</name>
  </enumValues>
  <enumValues>
    <name>КВыполнению</name>
  </enumValues>
  <enumValues>
    <name>Начат</name>
  </enumValues>
  <enumValues>
    <name>Завершен</name>
  </enumValues>
</mdclass:Enum>

Тестовая_база_ERP_14/src/Catalogs/Склады/Склады.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Склады</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>АГ_Транзитный</name>
      <description>Транзитный</description>
    </items>
  </predefined>
  <attributes>
    <name>ВыборГруппы</name>
    <type>
      <types>EnumRef.ВыборГруппыСкладов</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьАдресноеХранение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьАдресноеХранениеСправочно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьОрдернуюСхемуПриОтгрузке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьОрдернуюСхемуПриОтраженииИзлишковНедостач</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьОрдернуюСхемуПриПоступлении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьСерииНоменклатуры</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьСкладскиеПомещения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Календарь</name>
    <type>
      <types>CatalogRef.Календари</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтролироватьОперативныеОстатки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкаАдресногоХранения</name>
    <type>
      <types>EnumRef.НастройкиАдресногоХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>БизнесРегион</name>
    <type>
      <types>CatalogRef.БизнесРегионы</types>
    </type>
  </attributes>
  <attributes>
    <name>РозничныйВидЦены</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущаяДолжностьОтветственного</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекущийОтветственный</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСклада</name>
    <type>
      <types>EnumRef.ТипыСкладов</types>
    </type>
  </attributes>
  <attributes>
    <name>УровеньОбслуживания</name>
    <type>
      <types>EnumRef.УровниОбслуживания</types>
    </type>
  </attributes>
  <attributes>
    <name>УчетныйВидЦены</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>НачинатьОтгрузкуПослеФормированияЗаданияНаПеревозку</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользованиеРабочихУчастков</name>
    <type>
      <types>EnumRef.ИспользованиеСкладскихРабочихУчастков</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникИнформацииОЦенахДляПечати</name>
    <type>
      <types>EnumRef.ИсточникиИнформацииОЦенахДляПечати</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьСтатусыРасходныхОрдеров</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьСтатусыПриходныхОрдеров</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьСтатусыПересчетовТоваров</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаОрдернойСхемыПриОтгрузке</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаОрдернойСхемыПриПоступлении</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаОрдернойСхемыПриОтраженииИзлишковНедостач</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаИспользованияСкладскихПомещений</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаАдресногоХраненияОстатков</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьСебестоимостьПоСериям</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтролироватьОбеспечение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладОтветственногоХранения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПоклажедержателя</name>
    <type>
      <types>EnumRef.ВидыПоклажедержателей</types>
    </type>
  </attributes>
  <attributes>
    <name>Поклажедержатель</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокОтветственногоХранения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственноеХранениеДоВостребования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсобыеОтметки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УсловияХраненияТоваров</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦеховаяКладовая</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АГ_ОсновнойВидЦены</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>АГ_ВидЦеныМРЦ</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>АГ_МинимальныйВидЦены</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>АГ_ВидЦеныВнешнийПрайс</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>АГ_СкладWMS</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АГ_ОсновнойСклад</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Тестовая_база_ERP_14/src/AccumulationRegisters/ОбеспечениеПроизводственныхПроцессов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает таблицу полуфабрикатов производимых в процессе по переданному отбору
//
// Параметры:
//  МенеджерВременныхТаблиц	      - МенеджерВременныхТаблиц - менеджер временных таблиц
//  ИмяВТОтборПоПотребности	      - Строка				    - имя временной таблицы отбора по потребности
//  ИмяВременнойТаблицыРезультата - Строка				    - имя временной таблицы, в которую нужно поместить результат, если не указано, то результат будет выгружен.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - таблица полуфабрикатов производимых в процессе.
//
Функция ПолуфабрикатыВПроизводстве(МенеджерВременныхТаблиц, ИмяВТОтборПоПотребности = "", ИмяВременнойТаблицыРезультата = "") Экспорт
	
	ВыгрузитьРезультат = ИмяВременнойТаблицыРезультата = "";
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ОборотыПолуфабрикатов.Распоряжение КАК Распоряжение,
	|	
	|	ОборотыПолуфабрикатов.Номенклатура   КАК Номенклатура,
	|	ОборотыПолуфабрикатов.Характеристика КАК Характеристика,
	|	
	|	ОборотыПолуфабрикатов.Назначение КАК Назначение,
	|	ОборотыПолуфабрикатов.Этап       КАК Этап,
	|	
	|	ОборотыПолуфабрикатов.Склад          КАК Склад,
	|	ОборотыПолуфабрикатов.Подразделение  КАК Подразделение,
	|	
	|	ВЫБОР КОГДА ОборотыПолуфабрикатов.Склад <> ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка) ТОГДА
	|				ИСТИНА
	|			ИНАЧЕ
	|				ЛОЖЬ
	|		КОНЕЦ                             КАК ЭтоТовар,
	|	
	|	(ОборотыПолуфабрикатов.ТребуетсяОборот + ОборотыПолуфабрикатов.ЗапланированаРазборкаОборот) КАК Количество
	|	
	|ПОМЕСТИТЬ ВтОборотыПолуфабрикатовВПроизводстве
	|ИЗ
	|	РегистрНакопления.ОбеспечениеПроизводственныхПроцессов.Обороты(,,,
	|	
	|			(Номенклатура,Характеристика,Склад,Назначение) В(
	|				ВЫБРАТЬ
	|					Фильтр.Номенклатура   КАК Номенклатура,
	|					Фильтр.Характеристика КАК Характеристика,
	|					Фильтр.Склад          КАК Склад,
	|					Фильтр.Назначение     КАК Назначение
	|				ИЗ
	|					ВТОтборПоПотребности КАК Фильтр)
	|			
	|			И Назначение <> ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|			
	|		) КАК ОборотыПолуфабрикатов
	|ГДЕ
	|	(ОборотыПолуфабрикатов.ТребуетсяОборот + ОборотыПолуфабрикатов.ЗапланированаРазборкаОборот) > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&ТекстПоляЗаказ КАК Заказ,
	|
	|	Таблица.Номенклатура   КАК Номенклатура,
	|	Таблица.Характеристика КАК Характеристика,
	|	Таблица.Назначение     КАК Назначение,
	|	
	|	Таблица.Склад         КАК Склад,
	|	Таблица.Подразделение КАК Подразделение,
	|	
	|	ВЫБОР КОГДА Таблица.Склад <> ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка) ТОГДА
	|				ИСТИНА
	|			ИНАЧЕ
	|				ЛОЖЬ
	|		КОНЕЦ              КАК ЭтоТовар,
	|	
	|	Таблица.Количество КАК Количество
	|	
	|ПОМЕСТИТЬ ВтПолуфабрикатыВПроизводствеПереопределяемый
	|ИЗ
	|	ВтОборотыПолуфабрикатовВПроизводстве КАК Таблица
	|ГДЕ
	|	ВЫРАЗИТЬ(&ТекстПоляЗаказ КАК Документ.ЭтапПроизводства2_2).Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыЭтаповПроизводства2_2.Формируется)
	|;";
	
	ТекстПоляЗаказ = Документы.ЭтапПроизводства2_2.ТекстЗапросаПолеЭтапИсточник(
															"Таблица.Распоряжение",
															"Таблица.Этап",
															"Таблица.Назначение");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстПоляЗаказ", ТекстПоляЗаказ);
	
	Если ЗначениеЗаполнено(ИмяВТОтборПоПотребности) Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ВТОтборПоПотребности", ИмяВТОтборПоПотребности);
	КонецЕсли;
	
	Если ВыгрузитьРезультат Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ПОМЕСТИТЬ ВтПолуфабрикатыВПроизводствеПереопределяемый", "");
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ВтПолуфабрикатыВПроизводствеПереопределяемый", ИмяВременнойТаблицыРезультата);
	КонецЕсли;
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатВыполненияЗапроса = Запрос.Выполнить();
	
	Результат = Неопределено;
	Если ВыгрузитьРезультат Тогда
		Результат = РезультатВыполненияЗапроса.Выгрузить();
	КонецЕсли;
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбновлениеИнформационнойБазы

#КонецОбласти

#Область Прочее

Процедура ОтразитьДвижения(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	Таблица = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаОбеспечениеПроизводственныхПроцессов;
	
	Если Отказ ИЛИ Таблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Движения.ОбеспечениеПроизводственныхПроцессов.Записывать = Истина;
	Движения.ОбеспечениеПроизводственныхПроцессов.Загрузить(Таблица);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
